test/Malle/FSD_3D/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    outlet
    {
        type            calculated;
        value           $internalField;
    }

    coflowInletBottom
    {
        type            calculated;
        value           $internalField;
    }

    coflowInletTop
    {
        type            calculated;
        value           $internalField;
    }

    bottomWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    topWall
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           $internalField;
    }

    jetInlet
    {
        type            calculated;
        value           $internalField;
    }

    front
    {
        type            cyclic;
    }

    back
    {
        type            cyclic;
    }
}


// ************************************************************************* //
