test/Malle/FSD_3D/constant/reactionsH2AirOF4
elements        3(H O N);

species         4(H2 O2 H2O N2);

reactions
{
    un-named-reaction-0
    {
        type            reversibleArrheniusReaction;
        reaction        "H2 + 0.5O2 = H2O";
        A               5.692099788e+11;
        beta            0;
        Ta              8863.210481;
    }
}
