test/Malle/FSD_3D/system/blockMeshDict_SandiaD_3D
/*--------------------------------*- C++ -*----------------------------------*\
  3D Cartesian conversion of the real SandiaD_LTS radial/wedge mesh
  (blockMeshDict.radial, uploaded by the user), generated programmatically
  by remapping every vertex/block/patch 1:1 from the original file:

    - radial coordinate (x) and axial coordinate (z): UNCHANGED, same values
      as the original file (0/3.6/3.85/9.1/150mm radial stations, -100/0/500mm
      axial stations), same cell counts and grading per block.
    - wedge angular offset (y): REPLACED by a constant +-Ly/2 slab thickness
      (independent of radius, unlike the original wedge whose y-offset scaled
      with x). Each of the 3 degenerate axis vertices (old indices 0, 7, 16,
      all at x=0) is SPLIT into two distinct vertices (y=-Ly/2, y=+Ly/2) so the
      two "jet" blocks become genuine non-degenerate hexes instead of the
      wedge-collapsed prisms in the original file.
    - axis (type empty) -> symmetryPlane, replacing the collapsed centerline.
    - frontAndBack_pos/neg (type wedge) -> front/back (type cyclic).
    - mergeType/wedge-specific directives removed (no longer a wedge mesh).

  nCellsY (cells across the slice) is a new free parameter -- the original
  wedge mesh always had exactly 1 cell there by construction; pick nCellsY
  based on the resolution you actually want across Ly.
\*-----------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   0.001;

Ly          0.0072;   // slice thickness -- TUNE to your target resolution/scale
halfLy      #calc "0.5*$Ly";
nCellsY     18;       // cells across Ly -- TUNE (was fixed at 1 in the wedge mesh)

vertices
(
    (0.0  -$halfLy  -100.0)   // 0
    (0.0  $halfLy  -100.0)   // 1
    (3.6  -$halfLy  -100.0)   // 2
    (3.6  $halfLy  -100.0)   // 3
    (3.85  -$halfLy  -100.0)   // 4
    (3.85  $halfLy  -100.0)   // 5
    (9.1  -$halfLy  -100.0)   // 6
    (9.1  $halfLy  -100.0)   // 7
    (0.0  -$halfLy  0.0)   // 8
    (0.0  $halfLy  0.0)   // 9
    (3.6  -$halfLy  0.0)   // 10
    (3.6  $halfLy  0.0)   // 11
    (3.85  -$halfLy  0.0)   // 12
    (3.85  $halfLy  0.0)   // 13
    (9.1  -$halfLy  0.0)   // 14
    (9.1  $halfLy  0.0)   // 15
    (150.0  -$halfLy  0.0)   // 16
    (150.0  $halfLy  0.0)   // 17
    (0.0  -$halfLy  500.0)   // 18
    (0.0  $halfLy  500.0)   // 19
    (3.6  -$halfLy  500.0)   // 20
    (3.6  $halfLy  500.0)   // 21
    (3.85  -$halfLy  500.0)   // 22
    (3.85  $halfLy  500.0)   // 23
    (9.1  -$halfLy  500.0)   // 24
    (9.1  $halfLy  500.0)   // 25
    (150.0  -$halfLy  500.0)   // 26
    (150.0  $halfLy  500.0)   // 27
);

blocks
(
    hex (0 2 3 1 8 10 11 9)   (5 $nCellsY 20)   simpleGrading (1.0 1 1.0)
    hex (4 6 7 5 12 14 15 13)   (5 $nCellsY 20)   simpleGrading (1.0 1 1.0)
    hex (8 10 11 9 18 20 21 19)   (5 $nCellsY 70)   simpleGrading (1.0 1 2.0)
    hex (10 12 13 11 20 22 23 21)   (1 $nCellsY 70)   simpleGrading (1.0 1 2.0)
    hex (12 14 15 13 22 24 25 23)   (5 $nCellsY 70)   simpleGrading (1.0 1 2.0)
    hex (14 16 17 15 24 26 27 25)   (60 $nCellsY 70)   simpleGrading (3.0 1 2.0)
);

edges
(
);

boundary
(
    inletCH4
    {
        type patch;
        faces
        (
            (2 0 1 3)
        );
    }

    wallOutside
    {
        type wall;
        faces
        (
            (16 17 27 26)
        );
    }

    wallTube
    {
        type wall;
        faces
        (
            (2 3 11 10)
            (12 13 11 10)
            (5 4 12 13)
            (6 7 15 14)
        );
    }

    inletPilot
    {
        type patch;
        faces
        (
            (6 4 5 7)
        );
    }

    inletAir
    {
        type patch;
        faces
        (
            (16 14 15 17)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (18 20 21 19)
            (20 22 23 21)
            (22 24 25 23)
            (24 25 27 26)
        );
    }

    axis
    {
        type symmetryPlane;
        faces
        (
            (0 8 9 1)
            (8 18 19 9)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (3 1 9 11)
            (7 5 13 15)
            (11 9 19 21)
            (13 11 21 23)
            (15 13 23 25)
            (17 15 25 27)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (0 2 10 8)
            (4 6 14 12)
            (8 10 20 18)
            (10 12 22 20)
            (12 14 24 22)
            (14 16 26 24)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //